Repository: 84000/data-translation-memory
Catalog: toh216-v3.tmx
Source language: bo
Languages: en

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། རྒྱལ་པོ་ཆེན་པོ་ཅི་མྱ་ངན་ལས་འདའ་བ་ལ་ཆོས་གང་གི་ཡང་ལམ་ཡོད་དམ། གསོལ་པ།
en: Mañjuśrī replied, “Great King, is there any phenomenon such as a path in nirvāṇa?” “

source: །འཇམ་དཔལ་གྱིས་སྨྲས་པ། རྒྱལ་པོ་ཆེན་པོ་དེ་ལྟ་བས་ན་འཕགས་པ་རྣམས་ཀྱི་ལམ་བསྒོམ་པ་ནི་འགྲོ་བས་འགྲོ་བར་བྱ་བ་མ་ཡིན་ནོ། །གསོལ་པ།
en: Mañjuśrī said, “Therefore, Great King, when one cultivates the path of the noble ones, there is no need to go anywhere.” “

source: འཇམ་དཔལ་གང་ལ་གནས་ན་འཕགས་པ་དག་ལམ་སྒོམ་པ་ལགས། སྨྲས་པ།
en: Mañjuśrī, what do noble ones base themselves on to cultivate the path?” “

source: རྒྱལ་པོ་ཆེན་པོ་གནས་མེད་པ་ལ་གནས་ན་འཕགས་པ་དག་ལམ་སྒོམ་པ་ཡིན་ནོ།
en: Great King, noble ones cultivate the path by basing themselves on the absence of a basis.” “

source: །གསོལ་པ། འཇམ་དཔལ་ཚུལ་ཁྲིམས་དང་། ཤེས་རབ་དང་། ཏིང་ངེ་འཛིན་ལ་གནས་ན་འཕགས་པ་དག་ལམ་སྒོམ་པ་མ་ལགས་སམ། སྨྲས་པ།
en: Mañjuśrī, do noble ones not cultivate the path by basing themselves on discipline, insight, and absorption?” “

source: རྒྱལ་པོ་ཆེན་པོ་འཕགས་པ་རྣམས་ཀྱི་ཚུལ་ཁྲིམས་ནི་མངོན་པར་འདུ་མི་བྱེད་པའི་མཚན་ཉིད་དོ།
en: Great King, the discipline of noble ones is characterized as being free of application.

source: །རྒྱལ་པོ་ཆེན་པོ་འཕགས་པ་རྣམས་ཀྱི་ཏིང་ངེ་འཛིན་ནི་རྣམ་པར་མི་རྟོག་པའི་མཚན་ཉིད་དོ།
en: Great King, the absorption of noble ones is characterized as being free of concepts.

source: །རྒྱལ་པོ་ཆེན་པོ་འཕགས་པ་རྣམས་ཀྱི་ཤེས་རབ་ནི་མ་སྤྲོས་པའི་མཚན་ཉིད་དོ།
en: Great King, the insight of noble ones is characterized as being free of elaboration.

source: །རྒྱལ་པོ་ཆེན་པོ་དེ་ཇི་སྙམ་དུ་སེམས། མངོན་པར་འདུ་མི་བྱེད་པའམ།
en: Great King, what do you think?

source: མ་སྤྲོས་པ་ལ་གནས་ནུས་སམ།
en: Are you able to base yourself on the absence of application and elaboration?” “

source: གསོལ་པ། འཇམ་དཔལ་དེ་མ་ལགས་སོ།
en: Mañjuśrī, I am not.”

source: །འཇམ་དཔལ་གྱིས་སྨྲས་པ། རྒྱལ་པོ་ཆེན་པོ་རྣམ་གྲངས་དེས་ཀྱང་འདི་ལྟར་རིག་པར་བྱ་སྟེ། འཕགས་པ་དག་ནི་གནས་མེད་པ་ལ་གནས་ཏེ་ལམ་སྒོམ་མོ།
en: Mañjuśrī said, “Great King, based on that explanation, you should understand as follows: the noble ones cultivate the path by basing themselves on the absence of a basis.” “

source: །གསོལ་པ། འཇམ་དཔལ་ཇི་ལྟར་ན་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་ལམ་ལ་ཞུགས་པ་ལགས། སྨྲས་པ།
en: Mañjuśrī, how do sons or daughters of noble family enter the path?” “

source: རྒྱལ་པོ་ཆེན་པོ་ནམ་ཚོལ་བ་ན་ཆོས་གང་ཡང་མ་དམིགས་ཏེ། རྟག་པའམ། མི་རྟག་པའམ། ཆོས་གང་ཡང་སྡུག་པའམ། མི་སྡུག་པའམ།
en: Great King, when they examine, they do not observe any phenomena.

source: བདེ་བའམ། སྡུག་བསྔལ་བའམ། བདག་ཡོད་པའམ་བདག་མེད་པའམ། ཡང་གང་འཁོར་བའམ། མྱ་ངན་ལས་འདའ་བའི་ཆོས་གང་ཡང་མ་དམིགས་ཏེ།
en: They do not observe any phenomena that are permanent or impermanent, beautiful or ugly, or pleasant or painful, that have a self or lack a self, or that pertain to saṃsāra or nirvāṇa.

source: དེ་ལྟར་ཞུགས་ན་རྒྱལ་པོ་ཆེན་པོ་ལམ་ལ་ཞུགས་པ་ཞེས་བྱའོ།
en: If they can be in this way, Great King, they are said to have entered the path.”

source: །དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་རྒྱལ་པོ་མ་སྐྱེས་དགྲས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །འཇམ་དཔལ་བདག་གི་འགྱོད་པ་ངན་པ་སྦྱང་བའི་སླད་དུ་སང་འཁོར་དང་བཅས་ཏེ་བཤོས་ལ་གཤེགས་ན་ལེགས་སོ།
en: Then King Ajātaśatru requested of Mañjuśrī Kumārabhūta, “Mañjuśrī, if you would come for tomorrow’s meal with your retinue to clear away my awful remorse, it would be excellent.”

source: །འཇམ་དཔལ་གྱིས་སྨྲས་པ། རྒྱལ་པོ་ཆེན་པོ་གང་མེད་པ་དེ་ནི་གཞར་ཡང་མེད་དོ།
en: Mañjuśrī replied, “Great King, whatever is nonexistent is always that way.

source: །མེད་པས་ན་ཡོངས་སུ་གྲོལ་བ་ཡང་མེད་དོ།
en: Because it does not exist, it is without liberation.

source: །གང་ཡོངས་སུ་གྲོལ་བ་དེ་དག་ཀྱང་མེད་པས་ཡོངས་སུ་གྲོལ་ལོ།
en: What is liberated also does not exist, and hence it is liberated.

source: །མེད་པ་དེ་ཡང་གང་ལས་ཀྱང་ཡོངས་སུ་གྲོལ་བར་མི་འགྱུར་རོ།
en: Based on such nonexistence, nothing becomes liberated.

source: རྒྱལ་པོ་ཆེན་པོ་ཆོས་ཐམས་ཅད་ནི་རང་བཞིན་གྱིས་ཡོངས་སུ་གྲོལ་བའི་ཕྱིར་རོ།
en: Great King, it is because all phenomena are liberated by their very nature.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །འཇམ་དཔལ་ཁྱོད་རྒྱལ་པོ་མ་སྐྱེས་དགྲའི་དེར་ཟན་ལ་སོང་ཤིག །
en: Then the Blessed One told Mañjuśrī Kumārabhūta, “Mañjuśrī, please go to King Ajātaśatru’s place for food.

source: དེ་ན་འདི་ལ་སོགས་ཏེ་འགྲོ་བ་མང་པོའི་དོན་དུ་འགྱུར་རོ།
en: It will benefit him and many others.”

source: །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བཀའ་བཞིན་འཚལ།
en: Mañjuśrī Kumārabhūta responded to the Blessed One, “Blessed One, I will do as you say.

source: བདག་ནི་དེ་བཞིན་གཤེགས་པའི་བཀའ་མི་གཅོག་གོ།
en: I will not disobey the Thus-Gone One’s word.”

source: །དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་གནང་བར་རྒྱལ་པོ་མ་སྐྱེས་དགྲས་ཤེས་ནས།
en: When King Ajātaśatru understood that Mañjuśrī Kumārabhūta had accepted his invitation, he was happy and delighted.

source: དགའ་མགུ་རངས་རབ་ཏུ་དགའ་ཞིང་དགའ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་། དགེ་སློང་གི་དགེ་འདུན་ཐམས་ཅད་ཀྱི་ཞབས་ལ་ཡང་མགོ་བོས་ཕྱག་འཚལ་ཏེ་སོང་ངོ་།
en: Filled with joy, happiness, and delight, he bowed his head to the feet of the Blessed One and then to the feet of Mañjuśrī Kumārabhūta and the entire saṅgha of monks.

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་རྒྱལ་པོ་མ་སྐྱེས་དགྲས་འདི་སྐད་ཅེས་སྨྲས་སོ། །བཙུན་པ་ཤཱ་རིའི་བུ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་གཡོག་ཇི་སྙེད་ཅིག་མཆིས།
en: King Ajātaśatru then asked venerable Śāriputra, “Respected Śāriputra, how many servants does Mañjuśrī Kumārabhūta have?”

source: ཤཱ་རིའི་བུས་སྨྲས་པ། རྒྱལ་པོ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའ་ལྔ་བརྒྱ་ཙམ་དག་དང་ཐབས་ཅིག་ཏུ་བཤོས་གསོལ་ལོ།
en: Śāriputra responded, “Great King, he takes food with five hundred bodhisattvas.”

source: །དེ་ནས་རྒྱལ་པོ་མ་སྐྱེས་དགྲས་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ག་ལ་བ་དང་། བདག་གི་ཁང་པ་གང་ན་བར་སོང་སྟེ།
en: King Ajātaśatru returned to his residence in the city of Rājagṛha.

source: དེ་ཉིད་ཀྱི་ནུབ་མོ་བཟའ་བ་དང་། བཅའ་བ་དང་། མྱང་བ་དང་། བལྡག་པ་བཟང་ཞིང་མང་བ་སྦྱར་དུ་བཅུག་གོ།
en: That night, he ordered that a feast of excellent, savory, and delicious food and drinks be prepared.

source: །ཟས་རོ་བརྒྱ་པ་ཡང་སྦྱོར་དུ་བཅུག་གོ །
en: He ordered that many delicious dishes be prepared.

source: བདག་གནས་པའི་ཁང་པར་ཡང་དར་གྱི་ལྡ་ལྡི་བྲེས་ཤིང་གདུགས་དང་། རྒྱལ་མཚན་དང་།
en: He ordered that his residence be draped with silken tassels and decorated with parasols, banners, and standards.

source: བ་དན་གྱིས་ཀུན་ཏུ་བརྒྱན་ཏོ།
en: He ordered that it be adorned with silken canopies and perfumed with the finest incense.

source: །དར་གྱི་བླ་རེས་ཡང་བྲེས། སྤོས་ཤིན་ཏུ་སྙིང་པོར་གྱུར་པས་ཀྱང་བདུག་ཏུ་བཅུག་གོ། །གནས་ཁང་དེར་ཁྲི་གོས་དུ་མས་གཡོགས་པ། རིན་པོ་ཆེ་རྣམ་པ་སྣ་ཚོགས་དུ་མས་སྤྲས་པ་ལྔ་བརྒྱ་ཡང་བཙུགས་སོ།
en: He set up five hundred seats in his residence, which he covered with many varieties of cloth and decorated with many gems.

source: །དེའི་ཕྱོགས་ཐམས་ཅད་བྱི་དོར་ལེགས་པར་བྱས། ཞལ་ཞལ་ལེགས་པར་བྱུགས་ཤིང་། བདུག་པས་བདུགས་ནས་མེ་ཏོག་གི་སིལ་མས་ཀྱང་གང་བར་གཏོར་དུ་བཅུག་གོ། །རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོའི་འཕོངས་དང་།
en: He ordered that every corner of it be carefully swept, sprinkled, scented with fragrances, and covered with a scattering of flower petals.

source: ལམ་གྱི་སུམ་མདོ་དང་། འཕྲང་དང་། ཚོང་འདུས་ཐམས་ཅད་དུ་ཡང་ཆག་ཆག་ལེགས་པར་བཏབ། ཞལ་ཞལ་ལེགས་པར་བྱས། བདུག་པས་བདུགས་ཤིང་མེ་ཏོག་སིལ་མས་གང་བར་གཏོར་དུ་བཅུག་གོ།
en: He ordered that the gateways, junctions, passages, and markets in the city of Rājagṛha be cleansed, sprinkled, scented with fragrances, and covered with a scattering of flower petals.

source: །རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོའི་འགྲོ་བ་ཐམས་ཅད་ཀྱང་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་མཆོད་པའི་ལས་བྱེད་པར་བསྐོས་སོ།
en: He ordered that all the people of the city of Rājagṛha should engage in the veneration of Mañjuśrī Kumārabhūta.

source: །དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་བདག་གི་གཙུག་ལག་ཁང་ན་གནས་པ་ལས་ནུབ་མོ་ཐུན་དང་པོ་ལ་འདི་སྙམ་དུ་གྱུར་ཏེ། གང་བདག་ནི་འཁོར་ཉུང་ངུ་དང་། རྒྱལ་པོ་མ་སྐྱེས་དགྲའི་ཁབ་ཏུ་ཟས་བཟའ་བའི་མི་རིགས་ཀྱི། གང་བདག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་གཞན་ནས་བྱང་ཆུབ་སེམས་དཔའ་དག་གཉེར་ལ།
en: Then, when staying in his monastery during the first watch of the night, Mañjuśrī Kumārabhūta thought, “It would not be right if my retinue were too small for the food being prepared in King Ajātaśatru’s palace, so I should invite bodhisattvas from other buddha realms.

source: དེ་དག་ཐེ་ཙོམ་གཅོད་པའི་ཆོས་ཀྱང་ཉན། རྒྱལ་པོ་མ་སྐྱེས་དགྲའི་ཟས་ཀྱང་བཟའ་བར་བྱའོ་སྙམ་མོ།
en: They will listen to the Dharma that destroys doubt, and they will also eat King Ajātaśatru’s food.”

source: །དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་འདི་ལྟ་སྟེ། སྐྱེས་བུ་སྟོབས་པོ་ཆེའི་ལག་པ་བསྐུམ་པ་ལས་རྐྱོང་བའམ། བརྐྱང་པ་ལས་སྐུམ་པ་ཙམ་དུ་དེའི་སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་ལ་བདག་གི་གཙུག་ལག་ཁང་དུ་མི་སྣང་བར་གྱུར་ནས་ཤར་ཕྱོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་བརྒྱ་སྟོང་ཕྲག་བརྒྱད་ཅུ་འདས་ནས་འཇིག་རྟེན་གྱི་ཁམས་རྟག་ཏུ་སྒྲ་སྒྲོགས་ཞེས་བྱ་བར་ཕྱིན་པར་གྱུར་ཏེ། དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བསྒྲགས་པའི་དཔལ་ཞེས་བྱ་བ་བཞུགས་སོ། །འཚོའོ་གཞེས་སོ།
en: Then, in the time it would take a strong man to extend and contract his arm, Mañjuśrī Kumārabhūta disappeared from his monastery and traveled past eight million buddha realms to the east, arriving in the world called Eternally Resounding Sound, where the thus-gone, worthy, and perfect Buddha Resounding Glory lived and flourished.

source: །བྱང་ཆུབ་སེམས་དཔའ་འབའ་ཞིག་ལ་ཆོས་ཀྱང་སྟོན་ཏོ།
en: He taught the Dharma only to bodhisattvas.

source: །དེ་ན་ཕྱིར་མི་ལྡོག་པའི་ཆོས་ཀྱི་འཁོར་ལོ་གཅིག་ཀྱང་བསྐོར་ཏོ།
en: He turned only a single Dharma wheel of nonregression.

source: །ཡང་འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་རྒྱུ་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་པའི་ཤིང་མེ་ཏོག་དང་འབྲས་བུ་སྣ་ཚོགས་དང་ལྡན་པ་དག་ཡོད་དེ།
en: In that world was a tree made of the seven precious materials that bore various flowers and fruits.

source: རིན་པོ་ཆེའི་ཤིང་དེ་དག་རླུང་གིས་བཏབ་པ་ལས་སངས་རྒྱས་ཀྱི་སྒྲ་སྐད་འབྱུང་། ཆོས་ཀྱི་སྒྲ་སྐད་འབྱུང་། བྱང་ཆུབ་སེམས་དཔའི་ཕྱིར་མི་ལྡོག་པའི་དགེ་འདུན་གྱི་སྒྲ་སྐད་འབྱུང་ངོ་།
en: When stirred by the wind, this precious tree would produce the sound of “Buddha,” the sound of “Dharma,” and the sound of “nonregressing saṅgha of bodhisattvas.”

source: །འདི་ལྟ་སྟེ་འཇིག་རྟེན་གྱི་ཁམས་རྟག་ཏུ་སྒྲ་སྒྲོགས་ཞེས་བྱ་བ་ནི་འཇིག་རྟེན་གྱི་ཁམས་དེར་དཀོན་མཆོག་གསུམ་གྱི་སྒྲ་དང་མི་འབྲལ་བས་ན་རྟག་ཏུ་སྒྲ་སྒྲོགས་ཞེས་བྱའོ།
en: For this reason, because it was never devoid of the sound of the Three Jewels, the world Eternally Resounding Sound received its name.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་བསྒྲགས་པའི་དཔལ་དེའི་ཞབས་ལ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་མགོ་བོས་ཕྱག་འཚལ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་བསྒྲགས་པའི་དཔལ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དག་མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་རྒྱལ་པོ་མ་སྐྱེས་དགྲའི་ཁབ་ཏུ་བདག་དང་ལྷན་ཅིག་ཏུ་མཆོད་སྟོན་འཚལ་བར་བཀའ་སྩལ་དུ་གསོལ།
en: Mañjuśrī Kumārabhūta then bowed his head at the feet of the blessed thus-gone Resounding Glory and requested of him, “Blessed One, would the Thus-Gone One please ask your bodhisattva great beings to come with me from this buddha realm to the palace of King Ajātaśatru in the Sahā world for an offering feast?”

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་བསྒྲགས་པའི་དཔལ་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ལ་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དག་ཁྱེད་ལས་གང་འདོད་པ་རྣམས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་འགྲོགས་ཏེ། མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་དེང་ཤིག།
en: The thus-gone Eternally Resounding Sound then told his bodhisattva great beings, “Noble sons, may those among you who wish to accompany Mañjuśrī Kumārabhūta go to the Sahā world.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་དེ་དག་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྒྱད་ཁྲི་ཉིས་སྟོང་གིས་མགྲིན་གཅིག་ཏུ་ཚིག་སྨྲས་པ། བཅོམ་ལྡན་འདས་བདག་ཅག་ནི་མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་རྒྱལ་པོ་མ་སྐྱེས་དགྲའི་ཁབ་ཏུ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་མཆོད་སྟོན་འཚལ་དུ་མཆིའོ།
en: Upon hearing this, eighty-two thousand of the bodhisattva great beings in the retinue of bodhisattvas announced with one voice, “Blessed One, we wish to come with Mañjuśrī Kumārabhūta to King Ajātaśatru’s palace in the Sahā world for the offering feast.”

source: །དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་དེ་ཉིད་ཀྱི་ཐང་ཅིག་སྐད་ཅིག་ཡུད་ཙམ་ལ་བྱང་ཆུབ་སེམས་དཔའ་བརྒྱད་ཁྲི་ཉིས་སྟོང་པོ་དེ་དག་དང་འགྲོགས་ཏེ། འཇིག་རྟེན་གྱི་ཁམས་རྟག་ཏུ་སྒྲ་སྒྲོགས་ནས་མི་སྣང་བར་གྱུར་ཏེ་བདག་གི་གཙུག་ལག་ཁང་དུ་འདུག་གོ།
en: Then, in that very instant, Mañjuśrī Kumārabhūta, accompanied by these eighty-two thousand bodhisattvas, disappeared from the world called Eternally Resounding Sound and reappeared in his own monastery.

source: །དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་དེ་ལྟར་ཚོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལ་གཟུགས་ཞེས་བྱ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་རྒྱ་ཆེར་བཤད་དོ།
en: Mañjuśrī Kumārabhūta then gave the assembled bodhisattvas a detailed teaching called Dhāraṇī. “

source: །དེ་ལ་གཟུངས་གང་ཞེ་ན། གཟུངས་ཞེས་བྱ་བ་ནི་འདི་ལྟ་སྟེ། དྲན་པ་མ་ཉམས་པ། རྟོགས་པ་མ་གཡེངས་པ།
en: In this regard, what is dhāraṇī?

source: བློ་གྲོས་མ་རྨོངས་པ། ཤེས་རབ་མངོན་དུ་བྱེད་པ། ཆོས་ཐམས་ཅད་ལ་དེ་བཞིན་ཉིད་བསྟན་པས་ལམ་བསྟན་པ་ཤེས་པ། འབྲས་བུ་ཐོབ་ནས་སྲུང་བར་བྱེད་པ། ལམ་སྐྱོན་མེད་པ་ལ་འཇུག་ཤེས་པ། ཆོས་ཐམས་ཅད་ཀྱི་ཚིག་རབ་ཏུ་ཐ་དད་པ་ཤེས་པ། གཟུངས་ཀྱིས་འཕགས་པའི་རིགས་མི་གཅོད་པ།
en: Dhāraṇī refers to unfailing recollection; unwavering understanding; undeluded intelligence; clear knowledge; knowledge that comes from teaching the path by demonstrating suchness in all phenomena; guarding once the result is attained; knowledge of entering the flawless path; knowledge of the discrete labels for all phenomena; continuing the family of noble ones by means of dhāraṇī; upholding the family of the buddhas; consolidating the family of Dharma; knowing the family of the saṅgha to be in accord with the Dharma; being undeluded about questions and teachings; not being timid before any retinue; not being afraid before any retinue; knowing how to teach in the language of the gods; knowing how to teach in the language of the nāgas; knowing how to teach in the language of the yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, humans, nonhumans, Śakra, and Brahmā; knowing the faculties and genuine language; knowing mistaken views; understanding the faculties of all beings; placing the mind like the earth; being unperturbed by the eight worldly concerns; nurturing all virtuous qualities; teaching in accordance with the results of the ripening of actions; seeking the nourishment of all beings; establishing the base of discipline in all beings; being in accord with all forms of wisdom; shouldering the burden of the suffering of all beings without becoming discouraged or losing heart; knowing the nature of phenomena; demonstrating and describing this nature; feeling delighted rather than discouraged when giving the gift of Dharma; not desiring the ripening of any roots of virtue that one has accumulated; not being separate from the root of omniscience; being diligent in establishing the roots of omniscience; not being satisfied with giving but dedicating it to the mind of omniscience; not being satisfied with discipline but dedicating it to all beings; not being satisfied with patience but seeking the form of the buddhas; not being satisfied with diligence but amassing roots of virtue; not being satisfied with concentration but adopting the approach of nonapprehension; not being satisfied with knowledge but investigating everything; being sustained by the wealth of Dharma; and never committing evil deeds.

source: སངས་རྒྱས་ཀྱི་རིགས་འཛིན་པ། ཆོས་ཀྱི་རིགས་སྡུད་པ། དགེ་འདུན་གྱི་རིགས་ཆོས་ཀྱི་རྗེས་སུ་ཤེས་པ། དྲི་བ་ལུང་བསྟན་པ་ལ་མ་རྨོངས་པ། འཁོར་ཐམས་ཅད་དུ་མ་ཞུམ་པ། འཁོར་ཐམས་ཅད་དུ་མི་འཇིགས་པ། ལྷའི་སྐད་དུ་སྟོན་པ་ཤེས་པ། ཀླུའི་སྐད་དུ་སྟོན་པ་ཤེས་པ། གནོད་སྦྱིན་གྱི་སྐད་དང་། དྲི་ཟ་དང་།
en: Noble sons, dhāraṇī is to earnestly follow the Dharma with regard to these qualities.

source: ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་མི་མ་ཡིན་པ་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པའི་སྐད་དུ་སྟོན་པ་ཤེས་པ། སྐད་ཡང་དག་པ་དང་དབང་པོ་ཤེས་པ། ལོག་པར་ལྟ་བ་ཡོངས་སུ་ཤེས་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོ་ལ་རྟོག་པ། སེམས་ས་དང་མཚུངས་པར་གཞོག་པ། འཇིག་རྟེན་གྱི་ཆོས་བརྒྱད་ཀྱིས་མི་བསྐྱོད་པ། ཆོས་དཀར་པོ་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱེད་པ། ལས་ཀྱི་རྣམ་པར་སྨིན་པའི་འབྲས་བུ་ཇི་ལྟ་བ་བཞིན་དུ་སྟོན་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉེ་བའི་འཚོ་བར་རྩོལ་བ། ཚུལ་ཁྲིམས་ཀྱི་གཞི་སེམས་ཅན་ཐམས་ཅད་ལ་གནས་པ། ཡེ་ཤེས་ཐམས་ཅད་ཀྱི་རྗེས་སུ་སོང་བ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྡུག་བསྔལ་གྱི་ཁུར་ཁྱེར་ཡང་སེམས་སྐྱོ་ཞིང་དམུས་བྱུང་བ་མེད་པ། ཆོས་ཀྱི་རང་བཞིན་ཤེས་པ། རང་བཞིན་སྟོན་ཅིང་རྗོད་པ། ཆོས་ཀྱི་སྦྱིན་པས་སྤྲོ་བར་བྱེད་ཀྱི་སེམས་སྐྱོ་བར་མི་བྱེད་པ། དགེ་བའི་རྩ་བའི་ཚོགས་བསགས་པ་ཐམས་ཅད་ལ་རྣམ་པར་སྨིན་པར་མི་འདོད་པ། ཐམས་ཅད་མཁྱེན་པའི་སེམས་ཀྱི་རྩ་བ་དང་ཐ་མི་དད་པ། དེའི་རྩ་བ་ལ་འཇོག་པའི་བརྩོན་འགྲུས་ཅན། སྦྱིན་པས་ཆོག་མི་ཤེས་ལ་དེ་ཡང་ཐམས་ཅད་མཁྱེན་པའི་སེམས་ཀྱིས་བསྔོ་བ། ཚུལ་ཁྲིམས་ཀྱིས་ཆོག་མི་ཤེས་ལ་དེ་ཡང་སེམས་ཅན་ཐམས་ཅད་ལ་བསྔོ་བ། བཟོད་པས་ཆོག་མི་ཤེས་ལ་དེ་ཡང་སངས་རྒྱས་ཀྱི་གཟུགས་ཚོལ་བ། བརྩོན་འགྲུས་ཀྱིས་ཆོག་མི་ཤེས་ལ་དེ་ཡང་དགེ་བའི་རྩ་བ་སྡུད་པར་བྱེད་པ། བསམ་གཏན་གྱིས་ཆོག་མི་ཤེས་ལ་དེ་ཡང་མི་དམིགས་པའི་ཚུལ་དུ་བྱེད་པ། ཤེས་རབ་ཀྱིས་ཆོག་མི་ཤེས་ལ་དེ་ཡང་ཐམས་ཅད་དུ་དཔྱོད་པར་བྱེད་པ།
en: That is why it is called dhāraṇī. “

source: ཆོས་ཀྱི་ལོངས་སྤྱོད་ཀྱིས་འཚོ་ལ་དེ་ཡང་ཐམས་ཅད་དུ་ཁ་ན་མ་ཐོ་བ་མེད་པ་སྟེ། རིགས་ཀྱི་བུ་གཟུངས་གཟུངས་ཞེས་བྱ་བ་ནི་ཆོས་དེ་དག་ལ་ཆོས་ཀྱི་རྗེས་སུ་སོང་བའི་ནན་ཏན་ཡིན་ཏེ། དེ་བས་ན་གཟུངས་ཞེས་བྱའོ། །རིགས་ཀྱི་བུ་གཞན་ཡང་གཟུངས་ནི་ཆོས་ཐམས་ཅད་འཛིན་པར་བྱེད་དོ།
en: Moreover, noble sons, dhāraṇī contains all phenomena.

source: །ཇི་ལྟར་ན་གཟུངས་ཆོས་ཐམས་ཅད་འཛིན་པར་བྱེད་ཅེ་ན།
en: How does dhāraṇī contain all phenomena?

source: སྟོང་པ་ཉིད་ཀྱིས་ཆོས་ཐམས་ཅད་འཛིན་པར་བྱེད།
en: It contains all phenomena due to emptiness.

source: མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པས་ཆོས་ཐམས་ཅད་འཛིན་པར་བྱེད་པ། འདོད་ཆགས་དང་བྲལ་བ། དབེན་པ། དངོས་པོ་མེད་པ། ཐ་མི་
en: It contains all phenomena due to the absence of marks and the absence of wishes.

source: དད་པ། གནས་མེད་པ། མ་སྐྱེས་པ། མི་སྐྱེ་བ། མི་འོང་བ། མི་འགྲོ་བ། མི་གནས་པ། ཡང་དག་པར་མ་བྱུང་བ། མ་འཕོས་པ། མི་འཇིགས་པ། མི་བླང་བ། མི་དོར་བ། རང་བཞིན་མེད་པ། དངོས་པོ་མེད་པ། རྟོག་པ་མེད་པ། རྣམ་པར་རྟོག་པ་མེད་པ། སྒྲུབ་པ་མེད་པ། བདག་མེད་པ། སེམས་ཅན་མེད་པ།
en: All phenomena are contained due to nonattachment, disengagement, insubstantiality, undifferentiation, lack of basis, lack of birth, lack of appearance, lack of coming, lack of going, lack of resting, lack of emerging, lack of transfer, lack of fear, lack of accepting, lack of rejecting, lack of nature, lack of entity, and due to there being no thoughts, no concepts, no accomplishment, no self, no being, no life force, no person, no elaboration, no apprehension, no application, no occurrence, no seeing, no hearing, no touching, no experience, no contact, and no apprehension.

source: སྲོག་མེད་པ། གང་ཟག་མེད་པ། སྤྲོས་པ་མེད་པ། གཟུང་བ་མེད་པ། སྦྱོར་བ་མེད་པ། མ་བྱུང་བ། མ་མཐོང་བ། མ་ཐོས་པ།
en: Thus, it is called dhāraṇī. “

source: མ་མནམས་པ། མ་མྱངས་པ། མ་རེག་པ། མི་དམིགས་པས་ཆོས་ཐམས་ཅད་འཛིན་པས་ན་དེའི་ཕྱིར་གཟུངས་ཞེས་བྱའོ། །རིགས་ཀྱི་བུ་དག་གཞན་ཡང་གཟུངས་ནི་སྒྱུ་མའི་རང་བཞིན་གྱིས་ཆོས་ཐམས་ཅད་འཛིན་ཏོ།
en: Furthermore, noble sons, dhāraṇī contains all phenomena with an illusory nature.

source: །རྨི་ལམ་གྱི་རང་བཞིན་དང་། དབུ་བའི་རང་བཞིན་གྱིས་ཆོས་ཐམས་ཅད་འཛིན་ཏོ། །སྨིག་རྒྱུའི་རང་བཞིན་དང་། གཟུགས་བརྙན་གྱི་རང་བཞིན་དང་། སྒྲ་བརྙན་གྱི་རང་བཞིན་དང་།
en: Dhāraṇī contains all phenomena due to the dreamlike nature, the bubble-like nature, the mirage-like nature, the reflection-like nature, the echo-like nature, and the space-like nature.

source: ནམ་མཁའི་རང་བཞིན་གྱིས་ཆོས་ཐམས་ཅད་འཛིན་ཏེ་དེ་བས་ན་གཟུངས་ཞེས་བྱའོ།
en: Thus, it is called dhāraṇī.

source: །རིགས་ཀྱི་བུ་དག་གཞན་ཡང་གཟུངས་ནི་མི་རྟག་པས་ཆོས་ཐམས་ཅད་འཛིན་ཏོ།
en: Furthermore, noble sons, dhāraṇī contains all phenomena due to a lack of concepts.

source: །དེ་བཞིན་དུ་སྡུག་བསྔལ་བ་དང་། སྟོང་པ་དང་། བདག་མེད་པ་དང་། རང་བཞིན་གྱིས་མི་རྒྱུ་བ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པ་དང་། ཐོབ་པ་མེད་པ་དང་། མངོན་པར་བྱས་པ་མེད་པས་ཆོས་ཐམས་ཅད་འཛིན་ཏེ།
en: Likewise, it contains all phenomena due to suffering, emptiness, lack of self, lack of movement, lack of affliction, lack of purification, lack of attainment, and lack of action.

source: དེ་བས་ན་གཟུངས་ཞེས་བྱའོ།
en: Thus, it is called dhāraṇī. “

source: །རིགས་ཀྱི་བུ་དག་འདི་ལྟ་སྟེ། དཔེར་ན་ས་འདི་ནི་སྐྱེ་བོ་ཐམས་ཅད་འཛིན་མོད་ཀྱི་འགས་པར་ཡང་མི་འགྱུར། སྐྱོ་བར་ཡང་མི་འགྱུར་རོ།
en: Noble sons, to draw an analogy, while indeed the earth contains all beings, it does so without breaking or getting weary.

source: །རིགས་ཀྱི་བུ་དག་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གཟུངས་ཐོབ་པ་ཡང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཕྱིར་བསྐལ་པ་གྲངས་མེད་པར་ཐམས་ཅད་མཁྱེན་པར་སེམས་བསྐྱེད་པའི་དགེ་བའི་རྩ་བ་བསྡུས་པ་འཛིན་ཀྱང་འགས་པའང་མེད། སྐྱོ་བའང་མེད་དོ།
en: Noble sons, even though bodhisattva great beings who have attained dhāraṇī likewise spend countless eons gathering the roots of virtue that give rise to the mind of omniscience for the sake of all beings, they do so without breaking or getting weary. “

source: །རིགས་ཀྱི་བུ་དག་འདི་ལྟ་སྟེ། དཔེར་ན་ས་འདི་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉེ་བར་འཚོ་བ་ཡིན་ནོ།
en: Noble sons, to draw another analogy, the earth nourishes all beings.

source: །རིགས་ཀྱི་བུ་དག་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་གཟུངས་ཐོབ་པ་ཡང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉེ་བར་འཚོ་བ་ཡིན་ནོ།
en: Noble sons, bodhisattvas who have attained dhāraṇī likewise nourish all beings. “

source: །རིགས་ཀྱི་བུ་དག་འདི་ལྟ་སྟེ། དཔེར་ན་ས་ལ་གནས་ན་རྩྭ་དང་། ཤིང་གེལ་པ་དང་། སྨན་དང་། ནགས་ཚལ་ཐམས་ཅད་སྐྱེ་བར་འགྱུར་རོ།
en: Noble sons, to draw another analogy, all grasses, trees, herbs, and forests grow upon the earth.

source: །རིགས་ཀྱི་བུ་དག་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་གཟུངས་ལ་གནས་པའི་དགེ་བའི་ཆོས་ཐམས་ཅད་སྐྱེ་བར་འགྱུར་རོ།
en: Noble sons, bodhisattvas likewise grow their virtuous qualities upon dhāraṇī. “

source: །རིགས་ཀྱི་བུ་དག་འདི་ལྟ་སྟེ། དཔེར་ན་ས་ནི་ཆགས་པར་ཡང་མི་བྱེད། ཞེ་སྡང་བར་ཡང་མི་བྱེད། ཁེངས་པར་ཡང་མི་བྱེད།
en: Noble sons, to draw another analogy, the earth does not develop attachment or aggression, and it does not get puffed up or bow down.

source: དུད་པར་ཡང་མི་བྱེད་དོ། །རིགས་ཀྱི་བུ་དག་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་གཟུངས་ལ་གནས་པ་ཡང་ཆགས་པར་ཡང་མི་བྱེད། ཞེ་སྡང་བར་ཡང་མི་བྱེད། ཁེངས་པར་ཡང་མི་བྱེད།
en: Noble sons, bodhisattvas grounded in dhāraṇī likewise do not develop attachment or aggression, and they do not get puffed up or bow down. “

source: དུད་པར་ཡང་མི་བྱེད་དོ། །རིགས་ཀྱི་བུ་དག་འདི་ལྟ་སྟེ། དཔེར་ན་ས་ནི་ཆར་པའི་རྒྱུན་ཐམས་ཅད་ལེན་ཏེ། ཆོག་མི་ཤེས་པར་བྱེད་དོ།
en: Noble sons, to draw another analogy, the earth receives all rainfall without becoming saturated.

source: །རིགས་ཀྱི་བུ་དག་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་གཟུངས་ལ་གནས་པ་ཡང་སངས་རྒྱས་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་དག་དང་། ཡང་དག་པར་སོང་བ་དག་དང་། ཡང་དག་པར་ཞུགས་པ་དག་ལ་ཆོས་ཐམས་ཅད་ཉན་ན་ཡང་ཆོག་མི་ཤེས། འཆད་ན་ཡང་ཆོག་མི་ཤེས་སོ།
en: Noble sons, bodhisattvas grounded in dhāraṇī likewise do not become saturated when hearing about or teaching on all the qualities of buddhas, bodhisattvas, holy beings, and true practitioners. “

source: །རིགས་ཀྱི་བུ་དག་འདི་ལྟ་སྟེ། དཔེར་ན་ས་ནི་ས་བོན་ཐམས་ཅད་འཛིན་མོད་ཀྱི། དུས་ལ་མ་བབ་དྲོད་ལ་མ་བབ་པར་ལྗང་བུ་མི་སྐྱེད་དོ།
en: Noble sons, to draw another analogy, while indeed the earth holds every seed, until the right season and warmth appear, sprouts will not emerge.

source: །རིགས་ཀྱི་བུ་དག་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གཟུངས་ཐོབ་པ་ཡང་དགེ་བའི་རྩ་བའི་ས་བོན་ཐམས་ཅད་འཛིན་མོད་ཀྱི། དུས་མ་ཡིན། ཚོད་མ་ཡིན་ཞིང་སངས་རྒྱས་ཀྱི་ཆོས་ཡོངས་སུ་མ་རྫོགས་པར་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་མི་འདུག་གོ།
en: Likewise, Noble sons, while indeed bodhisattva great beings who attain dhāraṇī hold every seed of the roots of virtue, they will not sit at the Seat of Awakening until the time and measure is right for them to perfect the qualities of buddhahood. “

source: །རིགས་ཀྱི་བུ་དག་འདི་ལྟ་སྟེ། དཔེར་ན་དཔའ་བོ་ནི་ས་ལ་གནས་ན་ཕ་རོལ་གྱི་སྡེ་ཐམས་ཅད་ལས་རྒྱལ་བར་བྱེད་དོ།
en: Noble sons, to draw another analogy, a warrior defeats all their opponents while standing on the earth.

source: །རིགས་ཀྱི་བུ་དག་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གཟུངས་ཐོབ་པ་ཡང་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་ན་བདུད་ཀྱི་སྡེ་ཐམས་ཅད་ལས་རྒྱལ་བར་བྱེད་དོ། །རིགས་ཀྱི་བུ་དག་འདི་ལྟ་སྟེ།
en: Noble sons, bodhisattva great beings who attain dhāraṇī likewise defeat the hordes of Māra while seated at the Seat of Awakening. “
